In [2]:
import pandas as pd
data = pd.read_csv('../data/Sample_Data.csv')
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain   NaN  48000.0       Yes
2  Germany  30.0  54000.0        No
3      USA  20.0  35000.0        N0
4    Spain  38.0  61000.0        No

In [2]:
data.tail()

    Country   Age   Salary Purchased
10   France  48.0  79000.0       Yes
11   France  48.0  79000.0       Yes
12  Germany  50.0  83000.0        No
13   France  37.0  67000.0       Yes
14    franc  25.0  40000.0        No

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    15 non-null     object
 1   Age        13 non-null     float64
 2   Salary     14 non-null     float64
 3   Purchased  15 non-null     object
dtypes: float64(2), object(2)
memory usage: 608.0+ bytes

In [8]:
data['Age']

0     44.0
1      NaN
2     30.0
3     20.0
4     38.0
5     40.0
6     35.0
7     45.0
8      NaN
9     32.0
10    48.0
11    48.0
12    50.0
13    37.0
14    25.0
Name: Age, dtype: float64

In [6]:
data.describe()

             Age        Salary
count  13.000000     14.000000
mean   37.846154  59857.142857
std     9.290193  14722.338562
min    20.000000  35000.000000
25%    32.000000  50500.000000
50%    38.000000  59000.000000
75%    45.000000  70750.000000
max    50.000000  83000.000000

# Check missing data

In [ ]:
# check for NA values in the data
data.isna()

    Country    Age  Salary  Purchased
0     False  False   False      False
1     False   True   False      False
2     False  False   False      False
3     False  False   False      False
4     False  False   False      False
5     False  False    True      False
6     False  False   False      False
7     False  False   False      False
8     False   True   False      False
9     False  False   False      False
10    False  False   False      False
11    False  False   False      False
12    False  False   False      False
13    False  False   False      False
14    False  False   False      False

In [10]:
# check null values
data.isnull()

    Country    Age  Salary  Purchased
0     False  False   False      False
1     False   True   False      False
2     False  False   False      False
3     False  False   False      False
4     False  False   False      False
5     False  False    True      False
6     False  False   False      False
7     False  False   False      False
8     False   True   False      False
9     False  False   False      False
10    False  False   False      False
11    False  False   False      False
12    False  False   False      False
13    False  False   False      False
14    False  False   False      False

In [ ]:
# get the summary of null data
data.isnull().sum()

Country      0
Age          2
Salary       1
Purchased    0
dtype: int64

# Check duplicates

In [12]:
# select rows
data.loc[5,]

Country      Germany
Age             40.0
Salary           NaN
Purchased        Yes
Name: 5, dtype: object

In [13]:
# select multiple rows
data.loc[5:7, ]

   Country   Age   Salary Purchased
5  Germany  40.0      NaN       Yes
6   France  35.0  58000.0       Yes
7       US  45.0  60000.0       Yes

In [ ]:
# iloc[start: end, ] skips the stop value. ie 7th row is not included.
data.iloc[5:7, ]

   Country   Age   Salary Purchased
5  Germany  40.0      NaN       Yes
6   France  35.0  58000.0       Yes

In [15]:
# Find the duplicates
data[data.duplicated]

   Country   Age   Salary Purchased
11  France  48.0  79000.0       Yes

In [16]:
# Drop duplicated row
data.drop_duplicates()

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain   NaN  48000.0       Yes
2   Germany  30.0  54000.0        No
3       USA  20.0  35000.0        N0
4     Spain  38.0  61000.0        No
5   Germany  40.0      NaN       Yes
6    France  35.0  58000.0       Yes
7        US  45.0  60000.0       Yes
8     Spain   NaN  52000.0        No
9    German  32.0  50000.0       Yes
10   France  48.0  79000.0       Yes
12  Germany  50.0  83000.0        No
13   France  37.0  67000.0       Yes
14    franc  25.0  40000.0        No

In [19]:
# reflect change in the original data frame with inplace= true as parameter.
data.drop_duplicates(inplace=True)
data

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain   NaN  48000.0       Yes
2   Germany  30.0  54000.0        No
3       USA  20.0  35000.0        N0
4     Spain  38.0  61000.0        No
5   Germany  40.0      NaN       Yes
6    France  35.0  58000.0       Yes
7        US  45.0  60000.0       Yes
8     Spain   NaN  52000.0        No
9    German  32.0  50000.0       Yes
10   France  48.0  79000.0       Yes
12  Germany  50.0  83000.0        No
13   France  37.0  67000.0       Yes
14    franc  25.0  40000.0        No

# Reset index (after removing duplicates)